### 📖 Terraform Plan (infra/resources/dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.mcp_server.aws_api_gateway_deployment.mcp_server must be replaced
+/- resource "aws_api_gateway_deployment" "mcp_server" {
      ~ created_date = "2026-01-21T09:32:06Z" -> (known after apply)
      ~ id           = "4nauqg" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "c6b5410d91a95775ff361c9de584f59475482a7b"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.mcp_server.aws_api_gateway_integration.bedrock_search will be created
  + resource "aws_api_gateway_integration" "bedrock_search" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "awadwtf245"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:366865817117:function:dx-d-euc1-mcp-server-lambda-01/invocations"
    }

  # module.mcp_server.aws_api_gateway_method.search will be created
  + resource "aws_api_gateway_method" "search" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.Content-Type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_resource.search will be created
  + resource "aws_api_gateway_resource" "search" {
      + id          = (known after apply)
      + parent_id   = "3gckmfp48f"
      + path        = (known after apply)
      + path_part   = "search"
      + region      = "eu-central-1"
      + rest_api_id = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "4nauqg" -> (known after apply)
        id                    = "ags-awadwtf245-prod"
        tags                  = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-id-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-id-func-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-v3-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-v3-func-snet-01"
    }

  # module.testing.azurerm_virtual_network_peering.common_to_tests["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "common_to_tests" {
      ~ allow_gateway_transit                  = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/virtualNetworkPeerings/dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-github-runner-snet-01",
        ]
        name                                   = "dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-pep-snet-01",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.testing.azurerm_virtual_network_peering.tests_to_common["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "tests_to_common" {
      ~ allow_forwarded_traffic                = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-e2e-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-e2e-vnet-01/virtualNetworkPeerings/dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-pep-snet-01",
        ]
        name                                   = "dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-github-runner-snet-01",
        ]
      ~ use_remote_gateways                    = true -> false
        # (6 unchanged attributes hidden)
    }

  # module.testing.module.azure_cdn.azurerm_cdn_frontdoor_endpoint.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "this" {
        id                       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Cdn/profiles/dx-d-itn-test-afd-01/afdEndpoints/dx-d-itn-test-fde-01"
        name                     = "dx-d-itn-test-fde-01"
      ~ tags                     = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.4.0" -> "0.5.0"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
        # (3 unchanged attributes hidden)
    }

  # module.testing.module.cdn_origin_storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[dxditntestst01] Low Availability"
      + resource_group_name      = "dx-d-itn-integration-rg-01"
      + scopes                   = [
          + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Storage/storageAccounts/dxditntestst01",
        ]
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.4"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.testing.module.cdn_origin_storage_account.azurerm_security_center_storage_defender.this[0] will be created
  + resource "azurerm_security_center_storage_defender" "this" {
      + id                                          = (known after apply)
      + malware_scanning_on_upload_cap_gb_per_month = -1
      + malware_scanning_on_upload_enabled          = false
      + override_subscription_settings_enabled      = false
      + sensitive_data_discovery_enabled            = false
      + storage_account_id                          = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Storage/storageAccounts/dxditntestst01"
    }

  # module.testing.module.cdn_origin_storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-integration-rg-01/providers/Microsoft.Storage/storageAccounts/dxditntestst01"
        name                               = "dxditntestst01"
      ~ tags                               = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
        # (97 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 12 to add, 3 to change, 3 to destroy.

Warning: Reference to undefined provider

  on aws.tf line 12, in module "mcp_server":
  12:     aws.us_east_1 = aws.us-east-1

There is no explicit declaration for local provider name "aws.us_east_1" in
module.mcp_server, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us_east_1" with the source address "hashicorp/aws".

Warning: Deprecated attribute

  on .terraform/modules/testing.cdn_origin_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.testing.module.cdn_origin_storage_account.azurerm_storage_account.this,
  on .terraform/modules/testing.cdn_origin_storage_account/storage_account.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider
```

</details>
